# ComboBoxDropDownOpenedEventArgs Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ComboBoxDropDownOpenedEventArgs Constructor
ComboBoxDropDownOpenedEventArgs Class See Also
---
Initializes a new instance of the ComboBoxDropDownOpenedEventArgs class
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ComboBoxDropDownOpenedEventArgs()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ComboBoxDropDownOpenedEventArgs()
```

# See Also
ComboBoxDropDownOpenedEventArgs Class
Autodesk.Revit.UI.Events Namespace